*** src/config.rs:111:5: replace builtin_endpoint -> Option<CloudEndpoint> with None

*** mutation diff:
--- src/config.rs
+++ replace builtin_endpoint -> Option<CloudEndpoint> with None
@@ -103,48 +103,17 @@
     pub api: Api,
     pub base_url: String,
     pub default_model: String,
 }
 
 /// Built-in endpoint definitions. Anything not listed here must be configured
 /// explicitly — an unknown provider name is an error, never a silent default.
 pub fn builtin_endpoint(provider: &str) -> Option<CloudEndpoint> {
-    let e = match provider.to_ascii_lowercase().as_str() {
-        "anthropic" | "claude" => CloudEndpoint {
-            api: Api::Anthropic,
-            base_url: "https://api.anthropic.com".into(),
-            default_model: "claude-opus-5".into(),
-        },
-        "openai" => CloudEndpoint {
-            api: Api::OpenAiCompatible,
-            base_url: "https://api.openai.com/v1".into(),
-            default_model: "gpt-4o".into(),
-        },
-        // Google's OpenAI-compatible surface, so this needs no new `Api` variant.
-        // Shares the `google` connection id with the `gemini` CLI (see
-        // `cli_vendor_id`), which gives the picker paired "via CLI" / "via API" rows.
-        "google" | "gemini" => CloudEndpoint {
-            api: Api::OpenAiCompatible,
-            base_url: "https://generativelanguage.googleapis.com/v1beta/openai".into(),
-            default_model: "gemini-2.5-pro".into(),
-        },
-        "openrouter" => CloudEndpoint {
-            api: Api::OpenAiCompatible,
-            base_url: "https://openrouter.ai/api/v1".into(),
-            default_model: "openai/gpt-4o".into(),
-        },
-        "groq" => CloudEndpoint {
-            api: Api::OpenAiCompatible,
-            base_url: "https://api.groq.com/openai/v1".into(),
-            default_model: "llama-3.3-70b-versatile".into(),
-        },
-        _ => return None,
-    };
-    Some(e)
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 /// Maps an alias accepted by `builtin_endpoint` (`claude`, `gemini`) to the
 /// canonical id vendor discovery actually looks up in the keyring (`anthropic`,
 /// `google`). A key stored under the alias would be stored successfully but never
 /// found — discovery only ever asks for canonical ids. Kept visibly next to
 /// `builtin_endpoint`'s alias arms so a future alias gets added to both. Anything
 /// that isn't one of the two aliases — including a custom endpoint name — passes

---- config::tests::anthropic_and_openai_route_to_different_hosts stdout ----

thread 'config::tests::anthropic_and_openai_route_to_different_hosts' (803240) panicked at src/config.rs:301:55:
called `Option::unwrap()` on a `None` value

---- providers::cloud::tests::anthropic_and_openai_hit_different_urls stdout ----

thread 'providers::cloud::tests::anthropic_and_openai_hit_different_urls' (803351) panicked at src/providers/cloud.rs:206:36:
called `Option::unwrap()` on a `None` value

---- providers::cloud::tests::anthropic_body_omits_sampling_parameters stdout ----

thread 'providers::cloud::tests::anthropic_body_omits_sampling_parameters' (803352) panicked at src/providers/cloud.rs:206:36:
called `Option::unwrap()` on a `None` value

failures:
    config::tests::anthropic_and_openai_route_to_different_hosts
    providers::cloud::tests::anthropic_and_openai_hit_different_urls
    providers::cloud::tests::anthropic_body_omits_sampling_parameters
    providers::cloud::tests::anthropic_refusal_becomes_an_error_not_an_empty_string
    providers::cloud::tests::cloud_providers_are_always_remote
    providers::cloud::tests::empty_response_is_an_error_rather_than_a_silent_blank
    providers::cloud::tests::extracts_anthropic_text_blocks
    providers::cloud::tests::extracts_openai_content
    providers::cloud::tests::openai_body_puts_system_in_the_message_list

test result: FAILED. 360 passed; 9 failed; 0 ignored; 0 measured; 0 filtered out; finished in 24.46s

*** result: Failure(101)
