*** src/config.rs:112:9: delete match arm "anthropic" | "claude" in builtin_endpoint

*** mutation diff:
--- src/config.rs
+++ delete match arm "anthropic" | "claude" in builtin_endpoint
@@ -104,21 +104,17 @@
     pub base_url: String,
     pub default_model: String,
 }
 
 /// Built-in endpoint definitions. Anything not listed here must be configured
 /// explicitly — an unknown provider name is an error, never a silent default.
 pub fn builtin_endpoint(provider: &str) -> Option<CloudEndpoint> {
     let e = match provider.to_ascii_lowercase().as_str() {
-        "anthropic" | "claude" => CloudEndpoint {
-            api: Api::Anthropic,
-            base_url: "https://api.anthropic.com".into(),
-            default_model: "claude-opus-5".into(),
-        },
+         /* ~ changed by cargo-mutants ~ */
         "openai" => CloudEndpoint {
             api: Api::OpenAiCompatible,
             base_url: "https://api.openai.com/v1".into(),
             default_model: "gpt-4o".into(),
         },
         // Google's OpenAI-compatible surface, so this needs no new `Api` variant.
         // Shares the `google` connection id with the `gemini` CLI (see
         // `cli_vendor_id`), which gives the picker paired "via CLI" / "via API" rows.

---- config::tests::anthropic_and_openai_route_to_different_hosts stdout ----

thread 'config::tests::anthropic_and_openai_route_to_different_hosts' (807028) panicked at src/config.rs:328:55:
called `Option::unwrap()` on a `None` value

---- providers::cloud::tests::anthropic_and_openai_hit_different_urls stdout ----

thread 'providers::cloud::tests::anthropic_and_openai_hit_different_urls' (807144) panicked at src/providers/cloud.rs:206:36:
called `Option::unwrap()` on a `None` value

---- providers::cloud::tests::anthropic_body_omits_sampling_parameters stdout ----

thread 'providers::cloud::tests::anthropic_body_omits_sampling_parameters' (807145) panicked at src/providers/cloud.rs:206:36:
called `Option::unwrap()` on a `None` value

failures:
    config::tests::anthropic_and_openai_route_to_different_hosts
    providers::cloud::tests::anthropic_and_openai_hit_different_urls
    providers::cloud::tests::anthropic_body_omits_sampling_parameters
    providers::cloud::tests::anthropic_refusal_becomes_an_error_not_an_empty_string
    providers::cloud::tests::cloud_providers_are_always_remote
    providers::cloud::tests::extracts_anthropic_text_blocks

test result: FAILED. 363 passed; 6 failed; 0 ignored; 0 measured; 0 filtered out; finished in 24.76s

*** result: Failure(101)
