*** src/config.rs:117:9: delete match arm "openai" in builtin_endpoint

*** mutation diff:
--- src/config.rs
+++ delete match arm "openai" in builtin_endpoint
@@ -109,21 +109,17 @@
 /// explicitly — an unknown provider name is an error, never a silent default.
 pub fn builtin_endpoint(provider: &str) -> Option<CloudEndpoint> {
     let e = match provider.to_ascii_lowercase().as_str() {
         "anthropic" | "claude" => CloudEndpoint {
             api: Api::Anthropic,
             base_url: "https://api.anthropic.com".into(),
             default_model: "claude-opus-5".into(),
         },
-        "openai" => CloudEndpoint {
-            api: Api::OpenAiCompatible,
-            base_url: "https://api.openai.com/v1".into(),
-            default_model: "gpt-4o".into(),
-        },
+         /* ~ changed by cargo-mutants ~ */
         // Google's OpenAI-compatible surface, so this needs no new `Api` variant.
         // Shares the `google` connection id with the `gemini` CLI (see
         // `cli_vendor_id`), which gives the picker paired "via CLI" / "via API" rows.
         "google" | "gemini" => CloudEndpoint {
             api: Api::OpenAiCompatible,
             base_url: "https://generativelanguage.googleapis.com/v1beta/openai".into(),
             default_model: "gemini-2.5-pro".into(),
         },

---- config::tests::anthropic_and_openai_route_to_different_hosts stdout ----

thread 'config::tests::anthropic_and_openai_route_to_different_hosts' (809784) panicked at src/config.rs:329:49:
called `Option::unwrap()` on a `None` value

---- providers::cloud::tests::anthropic_and_openai_hit_different_urls stdout ----

thread 'providers::cloud::tests::anthropic_and_openai_hit_different_urls' (809898) panicked at src/providers/cloud.rs:206:36:
called `Option::unwrap()` on a `None` value

---- providers::cloud::tests::extracts_openai_content stdout ----

thread 'providers::cloud::tests::extracts_openai_content' (809904) panicked at src/providers/cloud.rs:206:36:
called `Option::unwrap()` on a `None` value

failures:
    config::tests::anthropic_and_openai_route_to_different_hosts
    providers::cloud::tests::anthropic_and_openai_hit_different_urls
    providers::cloud::tests::empty_response_is_an_error_rather_than_a_silent_blank
    providers::cloud::tests::extracts_openai_content
    providers::cloud::tests::openai_body_puts_system_in_the_message_list

test result: FAILED. 364 passed; 5 failed; 0 ignored; 0 measured; 0 filtered out; finished in 25.98s

*** result: Failure(101)
