*** src/config.rs:130:9: delete match arm "openrouter" in builtin_endpoint

*** mutation diff:
--- src/config.rs
+++ delete match arm "openrouter" in builtin_endpoint
@@ -122,21 +122,17 @@
         // Google's OpenAI-compatible surface, so this needs no new `Api` variant.
         // Shares the `google` connection id with the `gemini` CLI (see
         // `cli_vendor_id`), which gives the picker paired "via CLI" / "via API" rows.
         "google" | "gemini" => CloudEndpoint {
             api: Api::OpenAiCompatible,
             base_url: "https://generativelanguage.googleapis.com/v1beta/openai".into(),
             default_model: "gemini-2.5-pro".into(),
         },
-        "openrouter" => CloudEndpoint {
-            api: Api::OpenAiCompatible,
-            base_url: "https://openrouter.ai/api/v1".into(),
-            default_model: "openai/gpt-4o".into(),
-        },
+         /* ~ changed by cargo-mutants ~ */
         "groq" => CloudEndpoint {
             api: Api::OpenAiCompatible,
             base_url: "https://api.groq.com/openai/v1".into(),
             default_model: "llama-3.3-70b-versatile".into(),
         },
         _ => return None,
     };
     Some(e)

*** result: Success
