*** src/config.rs:153:5: replace canonical_provider -> &str with "xyzzy"

*** mutation diff:
--- src/config.rs
+++ replace canonical_provider -> &str with "xyzzy"
@@ -145,21 +145,17 @@
 /// Maps an alias accepted by `builtin_endpoint` (`claude`, `gemini`) to the
 /// canonical id vendor discovery actually looks up in the keyring (`anthropic`,
 /// `google`). A key stored under the alias would be stored successfully but never
 /// found — discovery only ever asks for canonical ids. Kept visibly next to
 /// `builtin_endpoint`'s alias arms so a future alias gets added to both. Anything
 /// that isn't one of the two aliases — including a custom endpoint name — passes
 /// through unchanged.
 pub fn canonical_provider(name: &str) -> &str {
-    match name.to_ascii_lowercase().as_str() {
-        "claude" => "anthropic",
-        "gemini" => "google",
-        _ => name,
-    }
+    "xyzzy" /* ~ changed by cargo-mutants ~ */
 }
 
 /// Which transport carries a connection's traffic. `Api` and `Cli` are the only two
 /// today; Ollama has no choice to make, so its `ConnectionSpec::transport` is `None`.
 #[derive(Debug, Clone, Copy, PartialEq, Eq, Serialize, Deserialize)]
 #[serde(rename_all = "snake_case")]
 pub enum Transport {
     Cli,

---- config::tests::aliases_canonicalise_to_the_id_discovery_reads_back stdout ----

thread 'config::tests::aliases_canonicalise_to_the_id_discovery_reads_back' (819902) panicked at src/config.rs:338:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "anthropic"

---- tests::auth_normalises_a_builtin_provider_name_so_discovery_can_find_the_stored_key stdout ----

thread 'tests::auth_normalises_a_builtin_provider_name_so_discovery_can_find_the_stored_key' (820191) panicked at src/main.rs:864:9:
assertion `left == right` failed
  left: "xyzzy"
 right: "anthropic"

failures:
    config::tests::aliases_canonicalise_to_the_id_discovery_reads_back
    tests::auth_normalises_a_builtin_provider_name_so_discovery_can_find_the_stored_key

test result: FAILED. 367 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 18.06s

*** result: Failure(101)
