*** src/config.rs:155:9: delete match arm "gemini" in canonical_provider

*** mutation diff:
--- src/config.rs
+++ delete match arm "gemini" in canonical_provider
@@ -147,17 +147,17 @@
 /// `google`). A key stored under the alias would be stored successfully but never
 /// found — discovery only ever asks for canonical ids. Kept visibly next to
 /// `builtin_endpoint`'s alias arms so a future alias gets added to both. Anything
 /// that isn't one of the two aliases — including a custom endpoint name — passes
 /// through unchanged.
 pub fn canonical_provider(name: &str) -> &str {
     match name.to_ascii_lowercase().as_str() {
         "claude" => "anthropic",
-        "gemini" => "google",
+         /* ~ changed by cargo-mutants ~ */
         _ => name,
     }
 }
 
 /// Which transport carries a connection's traffic. `Api` and `Cli` are the only two
 /// today; Ollama has no choice to make, so its `ConnectionSpec::transport` is `None`.
 #[derive(Debug, Clone, Copy, PartialEq, Eq, Serialize, Deserialize)]
 #[serde(rename_all = "snake_case")]

---- config::tests::aliases_canonicalise_to_the_id_discovery_reads_back stdout ----

thread 'config::tests::aliases_canonicalise_to_the_id_discovery_reads_back' (821424) panicked at src/config.rs:343:9:
assertion `left == right` failed
  left: "gemini"
 right: "google"

---- tests::auth_normalises_a_builtin_provider_name_so_discovery_can_find_the_stored_key stdout ----

thread 'tests::auth_normalises_a_builtin_provider_name_so_discovery_can_find_the_stored_key' (821722) panicked at src/main.rs:875:9:
assertion `left == right` failed
  left: "gemini"
 right: "google"

failures:
    config::tests::aliases_canonicalise_to_the_id_discovery_reads_back
    tests::auth_normalises_a_builtin_provider_name_so_discovery_can_find_the_stored_key

test result: FAILED. 367 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 20.58s

*** result: Failure(101)
