*** src/config.rs:245:9: replace Settings::load -> Result<Self> with Ok(Default::default())

*** mutation diff:
--- src/config.rs
+++ replace Settings::load -> Result<Self> with Ok(Default::default())
@@ -237,24 +237,17 @@
             connections: Default::default(),
             commander: None,
         }
     }
 }
 
 impl Settings {
     pub fn load(paths: &Paths) -> Result<Self> {
-        match fs::read_to_string(&paths.config_file) {
-            Ok(raw) => serde_json::from_str(&raw)
-                .with_context(|| format!("failed to parse {}", paths.config_file.display())),
-            Err(e) if e.kind() == std::io::ErrorKind::NotFound => Ok(Self::default()),
-            Err(e) => {
-                Err(e).with_context(|| format!("failed to read {}", paths.config_file.display()))
-            }
-        }
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Writes `config.json` atomically (temp file + rename), not with a bare
     /// `fs::write`. `fs::write` truncates the file before writing its new content, so a
     /// crash, power loss, or full disk in that window — and this file is rewritten on
     /// every picker submit, so the window recurs constantly — leaves `config.json`
     /// truncated or empty. `Settings::load` then fails to parse it at startup, taking
     /// the user's whole connection set and provider endpoints down with it until they

---- config::tests::settings_round_trip_through_disk stdout ----

thread 'config::tests::settings_round_trip_through_disk' (822979) panicked at src/config.rs:356:9:
assertion `left == right` failed
  left: "ollama"
 right: "anthropic"

failures:
    config::tests::settings_round_trip_through_disk

test result: FAILED. 368 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 18.65s

*** result: Failure(101)
