*** src/config.rs:248:23: replace match guard e.kind() == std::io::ErrorKind::NotFound with true in Settings::load

*** mutation diff:
--- src/config.rs
+++ replace match guard e.kind() == std::io::ErrorKind::NotFound with true in Settings::load
@@ -240,17 +240,17 @@
     }
 }
 
 impl Settings {
     pub fn load(paths: &Paths) -> Result<Self> {
         match fs::read_to_string(&paths.config_file) {
             Ok(raw) => serde_json::from_str(&raw)
                 .with_context(|| format!("failed to parse {}", paths.config_file.display())),
-            Err(e) if e.kind() == std::io::ErrorKind::NotFound => Ok(Self::default()),
+            Err(e) if true /* ~ changed by cargo-mutants ~ */ => Ok(Self::default()),
             Err(e) => {
                 Err(e).with_context(|| format!("failed to read {}", paths.config_file.display()))
             }
         }
     }
 
     /// Writes `config.json` atomically (temp file + rename), not with a bare
     /// `fs::write`. `fs::write` truncates the file before writing its new content, so a

*** result: Success
