*** src/config.rs:248:32: replace == with != in Settings::load

*** mutation diff:
--- src/config.rs
+++ replace == with != in Settings::load
@@ -240,17 +240,17 @@
     }
 }
 
 impl Settings {
     pub fn load(paths: &Paths) -> Result<Self> {
         match fs::read_to_string(&paths.config_file) {
             Ok(raw) => serde_json::from_str(&raw)
                 .with_context(|| format!("failed to parse {}", paths.config_file.display())),
-            Err(e) if e.kind() == std::io::ErrorKind::NotFound => Ok(Self::default()),
+            Err(e) if e.kind() != /* ~ changed by cargo-mutants ~ */ std::io::ErrorKind::NotFound => Ok(Self::default()),
             Err(e) => {
                 Err(e).with_context(|| format!("failed to read {}", paths.config_file.display()))
             }
         }
     }
 
     /// Writes `config.json` atomically (temp file + rename), not with a bare
     /// `fs::write`. `fs::write` truncates the file before writing its new content, so a

---- config::tests::settings_round_trip_through_disk stdout ----

thread 'config::tests::settings_round_trip_through_disk' (825483) panicked at src/config.rs:355:45:
called `Result::unwrap()` on an `Err` value: failed to read /tmp/.tmpFa7LCV/config.json

Caused by:
    No such file or directory (os error 2)

failures:
    config::tests::settings_round_trip_through_disk

test result: FAILED. 368 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 24.84s

*** result: Failure(101)
