*** src/config.rs:265:9: replace Settings::save -> Result<()> with Ok(())

*** mutation diff:
--- src/config.rs
+++ replace Settings::save -> Result<()> with Ok(())
@@ -257,21 +257,17 @@
     /// crash, power loss, or full disk in that window — and this file is rewritten on
     /// every picker submit, so the window recurs constantly — leaves `config.json`
     /// truncated or empty. `Settings::load` then fails to parse it at startup, taking
     /// the user's whole connection set and provider endpoints down with it until they
     /// repair or delete the file by hand. `vault.rs` already solved exactly this problem
     /// for `vault.enc`; `write_atomically` there is reused rather than duplicated here,
     /// per the audit's own observation that the fix was "lifting an existing function."
     pub fn save(&self, paths: &Paths) -> Result<()> {
-        let raw = serde_json::to_string_pretty(self)?;
-        // `write_atomically`'s own errors already name the temp and target paths, so no
-        // extra `.context(...)` is added here — layering one on would just repeat the
-        // same path in the message twice.
-        crate::vault::write_atomically(&paths.config_file, raw.as_bytes())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Resolves a provider name to an endpoint, preferring user overrides.
     pub fn endpoint(&self, provider: &str) -> Option<CloudEndpoint> {
         self.custom_endpoints
             .get(provider)
             .cloned()
             .or_else(|| builtin_endpoint(provider))

---- config::tests::saving_leaves_no_tmp_file_behind stdout ----

thread 'config::tests::saving_leaves_no_tmp_file_behind' (826010) panicked at src/config.rs:433:9:
fixture did not produce a config file to check alongside

---- config::tests::saving_over_a_longer_config_leaves_no_trailing_bytes stdout ----

thread 'config::tests::saving_over_a_longer_config_leaves_no_trailing_bytes' (826011) panicked at src/config.rs:391:57:
called `Result::unwrap()` on an `Err` value: Os { code: 2, kind: NotFound, message: "No such file or directory" }

---- config::tests::settings_round_trip_through_disk stdout ----

thread 'config::tests::settings_round_trip_through_disk' (826012) panicked at src/config.rs:359:9:
assertion `left == right` failed
  left: "ollama"
 right: "anthropic"

failures:
    config::tests::saving_leaves_no_tmp_file_behind
    config::tests::saving_over_a_longer_config_leaves_no_trailing_bytes
    config::tests::settings_round_trip_through_disk

test result: FAILED. 366 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 22.13s

*** result: Failure(101)
