*** src/config.rs:274:9: replace Settings::endpoint -> Option<CloudEndpoint> with None

*** mutation diff:
--- src/config.rs
+++ replace Settings::endpoint -> Option<CloudEndpoint> with None
@@ -266,20 +266,17 @@
         // `write_atomically`'s own errors already name the temp and target paths, so no
         // extra `.context(...)` is added here — layering one on would just repeat the
         // same path in the message twice.
         crate::vault::write_atomically(&paths.config_file, raw.as_bytes())
     }
 
     /// Resolves a provider name to an endpoint, preferring user overrides.
     pub fn endpoint(&self, provider: &str) -> Option<CloudEndpoint> {
-        self.custom_endpoints
-            .get(provider)
-            .cloned()
-            .or_else(|| builtin_endpoint(provider))
+        None /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// OS keyring access for API keys.
 pub struct Credentials;
 
 impl Credentials {
     fn entry(service: &str) -> Result<Entry> {

*** result: Success
