*** src/config.rs:292:9: replace Credentials::get -> Result<Option<SecretString>> with Ok(None)

*** mutation diff:
--- src/config.rs
+++ replace Credentials::get -> Result<Option<SecretString>> with Ok(None)
@@ -284,23 +284,17 @@
 impl Credentials {
     fn entry(service: &str) -> Result<Entry> {
         let namespaced = format!("{KEYRING_PREFIX}:{service}");
         Entry::new(&namespaced, DEFAULT_KEYRING_USER)
             .with_context(|| format!("failed to open keyring entry for {service}"))
     }
 
     pub fn get(service: &str) -> Result<Option<SecretString>> {
-        match Self::entry(service)?.get_password() {
-            Ok(secret) => Ok(Some(SecretString::from(secret))),
-            Err(keyring::Error::NoEntry) => Ok(None),
-            Err(e) => Err(anyhow!(
-                "failed to read {service} credential from keyring: {e}"
-            )),
-        }
+        Ok(None) /* ~ changed by cargo-mutants ~ */
     }
 
     pub fn set(service: &str, secret: &str) -> Result<()> {
         if secret.trim().is_empty() {
             return Err(anyhow!(
                 "refusing to store an empty credential for {service}"
             ));
         }

*** result: Success
