*** src/config.rs:313:9: replace Credentials::delete -> Result<()> with Ok(())

*** mutation diff:
--- src/config.rs
+++ replace Credentials::delete -> Result<()> with Ok(())
@@ -305,20 +305,17 @@
             ));
         }
         Self::entry(service)?
             .set_password(secret)
             .with_context(|| format!("failed to store {service} credential in keyring"))
     }
 
     pub fn delete(service: &str) -> Result<()> {
-        match Self::entry(service)?.delete_credential() {
-            Ok(()) | Err(keyring::Error::NoEntry) => Ok(()),
-            Err(e) => Err(anyhow!("failed to delete {service} credential: {e}")),
-        }
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
 
     #[test]

*** result: Success
