*** src/config.rs:74:5: replace restrict_to_owner -> Result<()> with Ok(())

*** mutation diff:
--- src/config.rs
+++ replace restrict_to_owner -> Result<()> with Ok(())
@@ -66,22 +66,17 @@
             None => Self::resolve(),
         }
     }
 }
 
 /// Tightens directory permissions to owner-only where the platform supports it.
 #[cfg(unix)]
 fn restrict_to_owner(dir: &Path) -> Result<()> {
-    use std::os::unix::fs::PermissionsExt;
-    let mut perms = fs::metadata(dir)?.permissions();
-    perms.set_mode(0o700);
-    fs::set_permissions(dir, perms)
-        .with_context(|| format!("failed to restrict permissions on {}", dir.display()))?;
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// On Windows the per-user AppData directory is already ACL'd to the owner; tightening
 /// it further would need explicit ACL manipulation, which is out of scope here.
 #[cfg(not(unix))]
 fn restrict_to_owner(_dir: &Path) -> Result<()> {
     Ok(())
 }

*** result: Success
